app/controllers/goals_controller.rb

SELECT "goals".* FROM "goals" ORDER BY created_at DESC
---
  def index
    @goals = Goal.all

INSERT INTO "goals" ("goal", "created_at", "updated_at") VALUES (?, ?, ?)  [["goal", "test2\n"], ["created_at", "2022-10-06 00:11:35.008269"], ["updated_at", "2022-10-06 00:11:35.008269"]]
---
  def create
    @goal = Goal.new(goal_params)

    respond_to do |format|
      if @goal.save

UPDATE "goals" SET "goal" = ?, "updated_at" = ? WHERE "goals"."id" = ?  [["goal", "ijoj"], ["updated_at", "2022-10-12 17:27:24.616000"], ["id", 11]]
---
  def update
    respond_to do |format|
      if @goal.update(goal_params)

DELETE FROM "goals" WHERE "goals"."id" = ?  [["id", 3]]
---
  def destroy
    @goal.destroy

SELECT "goals".* FROM "goals" WHERE "goals"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def set_goal
      @goal = Goal.find(params[:id])