app/views/goals/_profile.html.erb

						<p class="heading">Goals</p>
						<p class="title is-6"><%= current_user.goals.count %></p>
---
SELECT COUNT(*) FROM "goals" WHERE "goals"."user_id" = ?  [["user_id", 10]]